## ERD Database Design
### Jonathan Jones
#### 22.06.23

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/corebooks"

               ![png](Books-ERD.png)

In [3]:
# Create engine:

engine = create_engine(connection)

In [7]:
# Create a new data base:

# create_database(connection)

In [5]:
# Verfiy databases existence: 

database_exists(connection)

True

In [8]:
import pandas as pd

# adding data to the talbes in our database:

users = pd.read_csv('https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [9]:
users.to_sql('users', engine, if_exists = 'replace')

In [10]:
books = pd.read_csv('https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [11]:
books.to_sql('books', engine, if_exists = 'replace')

In [12]:
# adding data to the talbes in our database:

authors = pd.read_csv('https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [13]:
authors.to_sql('authors', engine, if_exists = 'replace')

In [14]:
# adding data to the talbes in our database:

favorites = pd.read_csv('https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [15]:
favorites.to_sql('favorites', engine, if_exists = 'replace')

In [17]:
q = '''SELECT 
    books.title, f.user_id
FROM
    books
        JOIN
    favorites AS f ON books.id = f.book_id
WHERE
    f.user_id = (SELECT 
            users.id
        FROM
            users
        WHERE
            (users.last_name = 'Doe'
                AND users.first_name = 'John'));'''
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1